"""
python中的数学运算
标头可以用三个双引号写注释
python中声明变量时，不需要声明数据类型

变量是数据的载体
1.字母、数字、下划线，不能使用特殊字符，数字不能开头
2.变量名区分大小写
3.不能使用Python中的关键字（Python代码中有特殊含义的单词）和保留字（pyhton中已经使用过的单词）
4.可读性高，见到变量的名字就知道它代表了什么意思
5.变量的命名使用小写，容易读。多个单词能用下划线或者大写字母进行分割
6当需要改掉所有的变量名的时候可以右键重命名
"""
print(123 + 45)
print(123 - 45)
print(123 * 45)
print(123 // 45)  # 整数除法
print(123 / 45)  # 真正的除法
print(123 % 45)  # 取模
print(123 ** 45)  # 求幂 计算123的45次方

a = 123
b = 45
print(a + b)
print(a - b)
print(a * b)
print(a // b)  # 整数除法
print(a / b)  # 真正的除法
print(a % b)  # 取模
print(a ** b)  # 求幂 计算123的45次方
